package HomeWork14;

import javafx.beans.binding.ListExpression;
import java.util.Arrays;
//import static org.apache.commons.*;

public class Main {}



//    1Написать метод, которому в качестве аргумента передается не пустой одномерный целочисленный массив.
//    Метод должен вернуть новый массив, который получен путем вытаскивания из исходного массива элементов,
//    идущих после последней четверки. Входной массив должен содержать хотя бы одну четверку, иначе в методе необходимо выбросить RuntimeException.
//    2Написать набор тестов для этого метода (по 3-4 варианта входных данных).
//    Вх: [ 1 2 4 4 2 3 4 1 7 ] -> вых: [ 1 7 ].

//
//    public static void main(String[] args) {
//
//        int[] test = {1, 2, 3, 4, 5, 6, 7, 8};
//        chekArr(test);
//
//    }

 //   public static int [] chekArr (int[] arr){

//        int newArr [] = ArrayUtils.subarray(arr, ArrayUtils.lastIndexOf(arr, 4) + 1, ArrayUtils.getLength(arr)+1);
//        if (arr.equals(arr))
//            throw new RuntimeException();
//        return newArr;
//    int sizeNewArr = 0;

 //  int [] resultArr  = null;
  //      for (int i = 0; i < arr.length; i++) {
   //         if (arr[i] == 4) { //ищем в массиве
   //             sizeNewArr = arr[i];//стартуем с этого элимента
  //          int[]   resultArr = new int[arr.length - i]; // создаем новые массив
  //              System.out.println(Arrays.toString(resultArr));
 //           }
//            for (int j = i + 1, k = 0; j < arr.length; j++, k++) {
//                if (arr[j] == 4) continue;
//                resultArr[k] = arr[j];
//                System.out.println(Arrays.toString(resultArr));
//            }
 //       }
//        try{
//        sizeNewArr = 1 / sizeNewArr;
//    } catch(ArithmeticException e){
//        throw new RuntimeException();
//    }
//    }


//}


//}
